html/docs/howto-org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HOWTO: Org Mode</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://bitmaster.se/css/org-font-optimized.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">HOWTO: Org Mode</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfa98f06">1. Per document TODO states</a></li>
<li><a href="#org7329123">2. Exporting to Other Formats</a>
<ul>
<li><a href="#org6efa660">2.1. Document Options</a></li>
<li><a href="#org38ce018">2.2. Explicit TOC</a></li>
<li><a href="#org9abbcfd">2.3. HTML custom CSS file</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa98f06" class="outline-2">
<h2 id="orgfa98f06"><span class="section-number-2">1.</span> Per document TODO states</h2>
<div class="outline-text-2" id="text-1">
<p>
Execute <code>C-c C-c</code> on a changed <code>#+todo</code> line to re-evaluate it.
</p>

<p>
Adds BLOCKED as a TODO state and CANCELED as a DONE state:
</p>
<div class="org-src-container">
<pre class="src src-org">#+todo: TODO BLOCKED | DONE CANCELED
</pre>
</div>

<p>
Defines keybindings for each state that are prompted for when <code>C-c C-t</code> is
invoked:
</p>
<div class="org-src-container">
<pre class="src src-org">#+todo: TODO(t) BLOCKED(b) | DONE(d) CANCELED(c)
</pre>
</div>

<p>
Asks for a logbook entry when entering the BLOCKED, DONE and CANCELED states.
</p>
<div class="org-src-container">
<pre class="src src-org">#+todo: TODO(t) BLOCKED(b@) | DONE(d@) CANCELED(c@)
</pre>
</div>

<p>
See <a href="https://orgmode.org/manual/Tracking-TODO-state-changes.html">https://orgmode.org/manual/Tracking-TODO-state-changes.html</a> for more
information about TODO state changes.
</p>
</div>
</div>


<div id="outline-container-org7329123" class="outline-2">
<h2 id="org7329123"><span class="section-number-2">2.</span> Exporting to Other Formats</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6efa660" class="outline-3">
<h3 id="org6efa660"><span class="section-number-3">2.1.</span> Document Options</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The following line:
</p>
<div class="org-src-container">
<pre class="src src-org">#+options: toc:nil num:0 H:4 author:nil timestamp:nil ^:nil
</pre>
</div>

<p>
Breaks down to:
</p>
<ul class="org-ul">
<li>Disables TOC</li>
<li>Disables section numbering</li>
<li>Generates 4 headline levels</li>
<li>Disables author information</li>
<li>Disables document creation timestamp</li>
<li>Disables the super-script markup tag (underscore character)</li>
</ul>
</div>
</div>

<div id="outline-container-org38ce018" class="outline-3">
<h3 id="org38ce018"><span class="section-number-3">2.2.</span> Explicit TOC</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Disable the TOC using the <code>toc:nil</code> option and include an explicit TOC tag.
</p>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-org">#+toc: headlines 2
</pre>
</div>

<p>
This makes it possible to include an introduction before the TOC.
Otherwise the TOC is always generated first in the exported document.
</p>
</div>
</div>

<div id="outline-container-org9abbcfd" class="outline-3">
<h3 id="org9abbcfd"><span class="section-number-3">2.3.</span> HTML custom CSS file</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Specify a CSS file to embed for HTML exports:
</p>
<div class="org-src-container">
<pre class="src src-org">#+setupfile: style.css.org
</pre>
</div>

<p>
Contents of file <code>style.css.org</code>:
</p>
<div class="org-src-container">
<pre class="src src-org">#+OPTIONS: org-html-head-include-default-style:nil
#+HTML_HEAD: &lt;style type="text/css"&gt;
#+HTML_HEAD: EMBEDDED_CSS_GOES_HERE
#+HTML_HEAD: &lt;/style&gt;
</pre>
</div>

<p>
<code>EMBEDDED_CSS_GOES_HERE</code> is regular CSS with each line prefixed with <code>#+HTML_HEAD:</code>.
</p>

<p>
See <a href="https://orgmode.org/manual/CSS-support.html">https://orgmode.org/manual/CSS-support.html</a> for more information.
</p>

<p>
My CSS file is kept at <a href="https://github.com/johan-bolmsjo/org_css">https://github.com/johan-bolmsjo/org_css</a> for reference.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-10-06</p>
</div>
</body>
</html>
